tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
cask_args appdir: "/Applications"

brew "asdf"
brew "awscli"
brew "bat"
brew "coreutils"
brew "curl"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gpg"
brew "grep"
brew "htop"
brew "jq"
brew "mas"
brew "neovim"
brew "nushell"
brew "procs"
brew "ripgrep"
brew "screen"
brew "sd"
brew "sk"
brew "starship"
brew "stow"
brew "tealdeer"
brew "terminal-notifier"
brew "tmux"
brew "tokei"
brew "vim"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"

cask "1password"
cask "alfred"
cask "appcleaner"
cask "clipy"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gpg-suite"
cask "gyazo"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "iina"
cask "iterm2"
cask "notion"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "vagrant"
cask "virtualbox" if system '[ "$(uname -m)" = "x86_64" ]'
cask "visual-studio-code"
cask "zoom"

mas "CleanMyMac X", id: 1339170533
mas "Magnet", id: 441258766
