tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
cask_args appdir: "/Applications"

brew "awscli"
brew "bat"
brew "corepack"
brew "coreutils"
brew "curl"
brew "dust"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "gpg"
brew "grep"
brew "htop"
brew "jq"
brew "neovim"
brew "procs"
brew "ripgrep"
brew "screen"
brew "sd"
brew "sk"
brew "stow"
brew "tealdeer"
brew "vim"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"

cask "1password"
cask "appcleaner"
cask "arc"
cask "brave-browser"
cask "cleanmymac"
cask "discord"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "gpg-suite"
cask "iina"
cask "karabiner-elements"
cask "kindle"
cask "miro"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# App Store
# ・Magnet
# ・LINE
# ・Presentify - Screen Annotation

tap "daipeihust/tap"
brew "daipeihust/tap/im-select"
